In [4]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [5]:
path = ("D:/Dataset/emp_salary.xlsx")

In [6]:
df = pd.read_excel(path)

In [7]:
df
df.describe()

       test_marks  interview_marks  experience        salary
count    9.000000         9.000000    9.000000  1.000000e+01
mean     6.222222         8.444444    2.111111  8.650000e+05
std      1.787301         1.013794    1.054093  2.211711e+05
min      3.000000         7.000000    1.000000  5.000000e+05
25%      5.000000         8.000000    1.000000  7.250000e+05
50%      6.000000         9.000000    2.000000  8.750000e+05
75%      7.000000         9.000000    3.000000  1.000000e+06
max      9.000000        10.000000    4.000000  1.200000e+06

In [8]:
test_mean = df.test_marks.mean()
e_mean = df.experience.mean()
i_med = df.interview_marks.median()

In [9]:
df["test_marks"]=df["test_marks"].fillna(test_mean)
df["experience"]=df["experience"].fillna(e_mean)
df["interview_marks"]=df["interview_marks"].fillna(i_med)

In [7]:
df

  emp_name  test_marks  interview_marks  experience   salary
0     John    9.000000              7.0    3.000000  1200000
1    Shark    8.000000              9.0    2.111111  1000000
2    Loren    6.000000             10.0    1.000000   800000
3     Dazy    6.222222              7.0    2.000000   900000
4     Rony    5.000000              8.0    1.000000   600000
5      Jos    6.000000              8.0    4.000000  1000000
6      Rio    7.000000              9.0    3.000000  1100000
7   Sakira    5.000000              9.0    1.000000   500000
8      Sam    7.000000              9.0    2.000000   850000
9      Lee    3.000000              9.0    2.000000   700000

In [8]:
x = df.drop(["emp_name","salary"],axis=1)
x

   test_marks  interview_marks  experience
0    9.000000              7.0    3.000000
1    8.000000              9.0    2.111111
2    6.000000             10.0    1.000000
3    6.222222              7.0    2.000000
4    5.000000              8.0    1.000000
5    6.000000              8.0    4.000000
6    7.000000              9.0    3.000000
7    5.000000              9.0    1.000000
8    7.000000              9.0    2.000000
9    3.000000              9.0    2.000000

In [9]:
y = df.drop(["emp_name","test_marks","interview_marks","experience"],axis=1)

In [10]:
y

    salary
0  1200000
1  1000000
2   800000
3   900000
4   600000
5  1000000
6  1100000
7   500000
8   850000
9   700000

In [11]:
from sklearn.linear_model import LinearRegression

In [12]:
model = LinearRegression()

In [13]:
model

LinearRegression()

In [14]:
model.fit(x,y)

LinearRegression()